exemplar_xmls/login_existing_user.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="10000"/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="staging.lpa.dsd.io" port="80" type="tcp"></server>
  </servers>

  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->

   <!-- Scenario: Average load  -->

   <arrivalphase phase="1" duration="10" unit="minute">
     <users interarrival="30" unit="second"></users>
   </arrivalphase>

   <!-- Scenario: High load  -->

   <arrivalphase phase="2" duration="10" unit="minute">
     <users interarrival="10" unit="second"></users>
   </arrivalphase>

   <!-- Scenario: Very load  -->
   <arrivalphase phase="3" duration="5" unit="minute">
     <users interarrival="2" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-example" probability="100" type="ts_http">

    <request><http url='http://staging.lpa.dsd.io/' version='1.1' method='GET'></http></request>

    <request><http url='http://staging.lpa.dsd.io/user/login' version='1.1' method='GET'></http></request>
    <thinktime random='true' value='61'/>

    <request><http url='http://staging.lpa.dsd.io/user/login' version='1.1'  contents='email=test3%40test.com&amp;password=Abc123123&amp;submit=Sign+in' content_type='application/x-www-form-urlencoded' method='POST'></http></request>

    <thinktime random='true' value='1'/>

    <request><http url='/user/dashboard' version='1.1' method='GET'></http></request>

    <thinktime random='true' value='3'/>

    <request><http url='http://staging.lpa.dsd.io/forward/newlpa' version='1.1' method='GET'></http></request>
    <request><http url='/create/lpa-type' version='1.1' method='GET'></http></request>

    <thinktime random='true' value='1'/>

    <request><http url='http://staging.lpa.dsd.io/create/lpa-type' version='1.1'  contents='lpa_type=Property+and+financial+affairs&amp;save=Save+and+continue' content_type='application/x-www-form-urlencoded' method='POST'></http></request>

    <thinktime random='true' value='2'/>

    <request><http url='/create/donor' version='1.1' method='GET'></http></request>

    <thinktime random='true' value='5'/>

    <request><http url='/pdf/draft/Lasting-Power-of-Attorney-Draft.pdf' version='1.1' method='GET'></http></request>

    <thinktime random='true' value='82'/>

  </session>
 </sessions>
</tsung>